/******************************************
		9.5、改进的欧拉方法求解初值 P208
******************************************/
#include<stdio.h>
#define N 10	//通过改变N的值，即可改变h

void main()
{
	int i;
	float h=1.0/N;
	float x[N+1]={0.0},y[N+1]={1.0};	//x[0]=0、y[0]=1
	float T1,T2;
	for(i=1;i<=N;i++)
	{
		x[i]=x[i-1]+h;
		T1=y[i-1]+h*(y[i-1]-2.0*x[i-1]/y[i-1]);
		T2=y[i-1]+h*(T1-2.0*x[i]/T1);
		y[i]=(T1+T2)/2.0;
	}  
	printf("用改进的欧拉方法求得值如下：\n");
	for(i=0;i<=N;i++)	//shuchu
	{
		printf("%3.6f -> %3.6f \n",x[i],y[i]);
	}
	printf("\n");
}