/********************************************
	9.6、四阶龙格-库塔方法求解初值 P208
********************************************/
#include<stdio.h>
#define N 10	//通过改变N的值，即可改变h

void main()
{
	int i;
	float h=1.0/N;
	float x[N+1]={0.0},y[N+1]={1.0};	//x[0]=0/y[0]=1
	float K1,K2,K3,K4;
	for(i=1;i<=N;i++)
	{
		x[i]=x[i-1]+h;
		K1=y[i-1]-2.0*x[i-1]/y[i-1];
		K2=y[i-1]+h/2.0*K1-((2.0*x[i-1]+h)/(y[i-1]+h/2.0*K1));
		K3=y[i-1]+h/2.0*K2-((2.0*x[i-1]+h)/(y[i-1]+h/2.0*K2));
		K4=y[i-1]+h*K3-((2.0*(x[i-1]+h))/(y[i-1]+h*K3));
		y[i]=y[i-1]+h/6.0*(K1+2*K2+2*K3+K4);
	}  
	printf("用四阶龙格-库塔方法求得值如下：\n");
	for(i=0;i<=N;i++)	//shuchu
	{
		printf("%3.6f -> %3.6f \n",x[i],y[i]);
	}
	printf("\n");
}